{
    "OCCUPATION": "Webentwickler und Tutor",
    "BORN": "Geboren",
    "IN": "in",
    "EDUCATION": "Ausbildung",
    "TU_DRESDEN": "Technische Universität Dresden",
    "LOCATION": "Ort",
    "CONTACT_REQUEST": "Kontaktanfrage",
    "EMAIL": "E-Mail",
    "SKILLS": "Fähigkeiten",
    "EXPERT": "Experte",
    "INTERMEDIATE": "Solide Kenntnisse",
    "BASIC": "Grundkenntnisse",
    "PROFILE": "Profil",
    "EXPERIENCE": "Erfahrung",
    "CONTACT": "Kontakt",
    "PROJECTS": "Projekte",
    "OTHER_ACTIVITIES": "Sonstige Aktivitäten",
    "USED_TECHNOLOGIES": "Eingesetzte Technologien:",
    "PRESENT": "heute",
    "KIWIGRID_DESCRIPTION": "Für die Kiwigrid GmbH arbeitete ich an der Konzeption und Umsetzung von Komponenten für das „Solarwatt-Energy-Portal”, eine Angular.js-App mit Schnittstellen für die Energie-Manager der Firma Solarwatt. Zu meinen Aufgaben gehörten das Refactoring von Charting-Komponenten zur Visualisierung von Stromverbrauchs- und -erzeugungsdaten im Zeitverlauf sowie die Umsetzung des Unit-Testings der Frontend-Komponenten mit Karma und Jasmine. Außerdem war ich an der Entwicklung zusätzlicher Teilanwendungen für die Endkunden beteiligt. Dazu gehörte unter anderem die Implementierung mehrerer Angular-Direktiven zur Datenvisualisierung sowie eines Kontaktformulars mit Backend-Anbindung.",
    "CARD_CRASH_DESCRIPTION": "CardCrash ist eine in Java geschriebene Library zum Auswerten von Poker-Händen. Sie ist lose angelehnt an die Javascript-Library <a href=\"https://github.com/mdp/hoyle\">Hoyle</a>, erzeugt aber eine genauere Aufschlüsselung der Hand. Besonderer Fokus lag außerdem auf dem objektorientierten Design und der Bereitstellung einer benutzerfreundlichen Programmierschnittstelle. Teilaspekte des Quellcodes von CardCrash benutze ich gerne als Lehrbeispiele für meine Studenten im Einzelunterricht, darunter das Multiton-Pattern, in dem die Karten-Klasse implementiert ist sowie die Enumerations für Rang und Farbe von Karten, die ihrerseits Konstruktoren und Methoden beinhalten; ein Sprach-Feature von Java, das selbst vielen selbsternannten Experten unbekannt ist."
}
