{
    "OCCUPATION": "Web Developer and Tutor",
    "BORN": "Born",
    "IN": "in",
    "EDUCATION": "Education",
    "TU_DRESDEN": "Dresden University of Technology",
    "LOCATION": "Location",
    "CONTACT_REQUEST": "Contact request",
    "EMAIL": "E-mail",
    "TELEPHONE": "Phone: +49 (176) 647 01207",
    "SKILLS": "Skills",
    "EXPERT": "Expert",
    "INTERMEDIATE": "Intermediate",
    "BASIC": "Basic",
    "PROFILE": "Profile",
    "EXPERIENCE": "Experience",
    "CONTACT": "Contact",
    "PROJECTS": "Projects",
    "OTHER_ACTIVITIES": "Other activities",
    "USED_TECHNOLOGIES": "Technologies:",
    "PRESENT": "present",
    "EXPERIENCE_INTRO": "I have been passionate about programming and software development for as long as I can remember. Below you'll find an assortment of notable activities and project I've worked on in the past.",
    "CV_DOWNLOAD_HINT": "You can download this CV either in Word format or as a PDF:",
    "CV_DOWNLOAD_WORD_HREF": "assets/resume_en.docx",
    "CV_DOWNLOAD_WORD_TEXT": "Download CV as Word (.docx) file",
    "CV_DOWNLOAD_PDF_HREF": "assets/resume_en.pdf",
    "CV_DOWNLOAD_PDF_TEXT": "Download CV as PDF file",
    "KIWIGRID_DESCRIPTION": "For the green-energy startup Kiwigrid I helped design and implement components for the cloud-based \"Solarwatt Energy Portal\", an Angular.js application with interfaces to energy-managing devices manufactured by Solarwatt. My activities included refactoring of charting components allowing the visualization of power production and consumption data over time as well as unit testing frontend components using Karma and Jasmine. Additionally I was involved in the conception and implementation of newly created utility apps for clients. Among my contributions were several Angular directives for data visualization and a contact form with a REST interface.",
    "CARD_CRASH_DESCRIPTION": "CardCrash is a poker hand evaluation library written in Java. It is loosely inspired by the similar Javascript library <a href=\"https://github.com/mdp/hoyle\">Hoyle</a>, but offers a more detailed breakdown of a hand. Among the main goals while working on CardCrash were a sensible object-oriented design of the code and creating a user-friendly programming interface. Several aspects of its code regularly serve as examples in lessons with my programming students. These include the multiton design pattern used for card creation or the definitions of the enumerations for card ranks and suits, which contain constructors and methods just like a \"normal\" class; a Java language feature largely unknown even to many self-proclaimed experts.",
    "HOLDEM_TIGHT_DESCRIPTION": "Tracking app for Textas Hold'em poker games written in Angular.js. Players can be placed at a virtual poker table and have their actions recorded, cards assigned to them and their hands evaluated. Hand evaluation is achieved on the server side using the Javascript library <a href=\"https://github.com/mdp/hoyle\">Hoyle</a>. The app knows about the rules of the game and only allows for actions that are legal. Deveopment of Hold'em Tight is still in progress, things like statistical analysis of a player's behavior and saving and loading game state are in the pipeline. The code is almost completely covered by unit tests. The backend is implemented in node.js using the routing framework Express. All views are Jade templates that are rendered by the backend before being served to the client.",
    "SCRIPTEX_DESCRIPTION": "Scriptex is a node.js module to convert screenplays from text files into LaTeX files utilizing the LaTeX class <a href=\"http://www.ctan.org/tex-archive/macros/latex/contrib/screenplay\">screenplay</a>. The output LaTeX file can be used to generate a PDF of the screenplay following the industry standard format. During the implementation I put special emphasis on allowing maximum flexibility with regard to the format of the input files. Things like indentation size used in the text file are completely customizable. The code naturally relies heavily on string and file operations. Included in the project's code on Github are screenplays of several episodes of the first season of <a href=\"https://en.wikipedia.org/wiki/Twin_Peaks\">the best TV show of all time</a>.",
    "TETRIX_DESCRIPTION": "Tetrix is a clone of the universally popular computer game classic Tetris for the mobile operating system Android. It was available on the Google Play Store for about two years before it was removed via DMCA takedown. The game was optimized for Android 2.3. This app, too, was designed with maximum customizability in mind. The user could choose freely which stones were allowed to pop up in the game. Another main goal during development was an efficient object-oriented software design to allow for fluent game play despite limited resources found in smartphones at the time. Design patterns like flyweight, prototype, abstract factory, command and strategy were applied, which lead to several aspects of this app serving as good teching examples in lessons with my students.",
    "TUTORING_NAME": "Private tutor",
    "TUTORING_DESCRIPTION": "I helped many high school and university students along their way to tests and exams in math and computer science over the years and was one of the most requested tutors in Dresden through the tutoring agency <a href=\"https://tutoria.de\">tutoria</a> during that time. I also had profiles on other platforms and found more and more students over time, often university students with technical majors who needed short or long term assistance learning programming.",
    "UNIVERSITY_NAME": "Java tutor, Dresden University of Technology",
    "UNIVERSITY_DESCRIPTION": "I gave the course \"Software and programming technology in mechanical engineering\" during the summer semester of 2014 to students of various majors. It consisted of both lecturing them about object-oriented software development using Java and supervising their work in a practical course. I was also involved in the marking of their exams at the end of the semester. Contents of the course included Java language fundamentals, object-oriented analysis using different kinds of UML diagrams and software documentation using Javadoc.",
    "FRAUNHOFER_NAME": "Student assistant, Fraunhofer IVI",
    "FRAUNHOFER_DESCRIPTION": "At <a href=\"http://www.ivi.fraunhofer.de\">Fraunhofer Institute for Transportation and Infrastructure Systems IVI</a> I autonomously developed components for a disaster management software written in Java. Moreover I worked on a project dealing with predicting trafficability for different kinds of vehicles based on soil, weather, and terrain data, which was implemented in Python for ArcGIS.",
    "RESPONSIBLE_FOR_CONTENT": "Responsible for contents",
    "CONTACT_INFORMATION": "Contact information",
    "CONTACT_INTRO": "If you're interested in what I have to offer, don't hesitate to contact me."
}
